evaluation/ycsb_pm_results/redis/Runb/Run2
127.0.0.1
[OVERALL], RunTime(ms), 455879
[OVERALL], Throughput(ops/sec), 21935.645204100212
[TOTAL_GCS_G1_Young_Generation], Count, 40
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 109
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.02390985327246923
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 40
[TOTAL_GC_TIME], Time(ms), 109
[TOTAL_GC_TIME_%], Time(%), 0.02390985327246923
[READ], Operations, 9500249
[READ], AverageLatency(us), 43.712189859444734
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 8423
[READ], 95thPercentileLatency(us), 52
[READ], 99thPercentileLatency(us), 58
[READ], Return=OK, 9500249
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3009.0
[CLEANUP], MinLatency(us), 3008
[CLEANUP], MaxLatency(us), 3009
[CLEANUP], 95thPercentileLatency(us), 3009
[CLEANUP], 99thPercentileLatency(us), 3009
[UPDATE], Operations, 499751
[UPDATE], AverageLatency(us), 40.887445948082146
[UPDATE], MinLatency(us), 21
[UPDATE], MaxLatency(us), 4819
[UPDATE], 95thPercentileLatency(us), 49
[UPDATE], 99thPercentileLatency(us), 55
[UPDATE], Return=OK, 499751